; domain
(define (domain blocks-domain)

(:requirements :strips :typing :fluents :disjunctive-preconditions :equality :negative-preconditions )

(:types 
        block - object
        gar - object
)

(:predicates 
	(inhand ?block - block) 
	(emptyhand) 
	(on ?block ?on_block - block) 
	(clear ?block - block)
	(table ?block - block)
)
(:action pickBlock
    :parameters 
    (
        ?b - block
        ?t - block
    )
    :precondition
    (and 
        (not (inhand ?b))
        (not (inhand ?t))
        (not(table ?b))
        (on ?b ?t)
        (emptyhand)
        (clear ?b)
        (not(= ?b ?t))
    )
    :effect 
    (and
        (inhand ?b)
        (not(emptyhand))
        (clear ?t)
        (not(on ?b ?t))
    )
)
(:action stack
    :parameters 
    (
        ?b - block 
        ?t - block
    )
    :precondition 
        (and
            (inhand ?b)
            (not(emptyhand))
            (or
                (and
                    (table ?t)
                    (clear ?t)
                )
                (clear ?t)
                )
            (not(= ?b ?t))
        )
    :effect 
        (and
            (on ?b ?t)
            (not(clear ?t))
            (clear ?b)
            (not(inhand ?b))
            (emptyhand)
        )
     )
)

; problem
(define (problem problemPDDL)
    (:domain blocks-domain)
    (:requirements :disjunctive-preconditions :equality :strips :typing :negative-preconditions)
    (:objects a b c d e t1 t2 t3 t4 t5 - block)
    (:init (clear a) (clear b) (clear c) (clear d) (emptyhand) (on a e) (on b t5) (on c t3) (on d t2) (on e t1) (table t1) (table t2) (table t3) (table t4) (table t5))
    (:goal (and (on e t5) (on a e) (on d t3) (on c b) (on b d)))
)

; plan
1. (pickblock b t5)
   deleted: (emptyhand) (on b t5)
   added: (inhand b) (clear t5)
   goals met: 1 of 5
2. (stack b d)
   deleted: (clear d) (inhand b)
   added: (on b d) (emptyhand)
   goals met: 2 of 5
3. (pickblock c t3)
   deleted: (emptyhand) (on c t3)
   added: (inhand c) (clear t3)
   goals met: 2 of 5
4. (stack c b)
   deleted: (clear b) (inhand c)
   added: (on c b) (emptyhand)
   goals met: 3 of 5
5. (pickblock a e)
   deleted: (emptyhand) (on a e)
   added: (inhand a) (clear e)
   goals met: 2 of 5
6. (stack a t3)
   deleted: (clear t3) (inhand a)
   added: (on a t3) (emptyhand)
   goals met: 2 of 5
7. (pickblock e t1)
   deleted: (emptyhand) (on e t1)
   added: (inhand e) (clear t1)
   goals met: 2 of 5
8. (stack e t5)
   deleted: (clear t5) (inhand e)
   added: (on e t5) (emptyhand)
   goals met: 3 of 5
9. (pickblock a t3)
   deleted: (emptyhand) (on a t3)
   added: (inhand a) (clear t3)
   goals met: 3 of 5
10. (stack a e)
   deleted: (clear e) (inhand a)
   added: (on a e) (emptyhand)
   goals met: 4 of 5
11. (pickblock c b)
   deleted: (emptyhand) (on c b)
   added: (inhand c) (clear b)
   goals met: 3 of 5
12. (stack c t1)
   deleted: (clear t1) (inhand c)
   added: (on c t1) (emptyhand)
   goals met: 3 of 5
13. (pickblock b d)
   deleted: (emptyhand) (on b d)
   added: (inhand b) (clear d)
   goals met: 2 of 5
14. (stack b a)
   deleted: (clear a) (inhand b)
   added: (on b a) (emptyhand)
   goals met: 2 of 5
15. (pickblock d t2)
   deleted: (emptyhand) (on d t2)
   added: (inhand d) (clear t2)
   goals met: 2 of 5
16. (stack d t3)
   deleted: (clear t3) (inhand d)
   added: (on d t3) (emptyhand)
   goals met: 3 of 5
17. (pickblock b a)
   deleted: (emptyhand) (on b a)
   added: (inhand b) (clear a)
   goals met: 3 of 5
18. (stack b d)
   deleted: (clear d) (inhand b)
   added: (on b d) (emptyhand)
   goals met: 4 of 5
19. (pickblock c t1)
   deleted: (emptyhand) (on c t1)
   added: (inhand c) (clear t1)
   goals met: 4 of 5
20. (stack c b)
   deleted: (clear b) (inhand c)
   added: (on c b) (emptyhand)
   goals met: 5 of 5
